IDENTIFICATION DIVISION.
PROGRAM-ID. Controller.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 USER-INPUT PIC X(5).
01 CALCULATED-DATA PIC 9(5).

PROCEDURE DIVISION.
    CALL 'View' USING USER-INPUT.

    ACCEPT USER-INPUT.

    CALL 'Model' USING USER-INPUT RETURNING CALCULATED-DATA.

    MOVE CALCULATED-DATA TO USER-INPUT.
    CALL 'View' USING USER-INPUT.

    EXIT PROGRAM.
