IDENTIFICATION DIVISION.
PROGRAM-ID. Model.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 INPUT-DATA PIC 9(5).
01 CALCULATED-DATA PIC 9(5).

PROCEDURE DIVISION USING INPUT-DATA RETURNING CALCULATED-DATA.
    MOVE INPUT-DATA TO CALCULATED-DATA.
    ADD 10 TO CALCULATED-DATA.
    EXIT PROGRAM.
